benchmarkingExperiments/data/initial_experiments/16t16c600rps.out
Running 1m test @ http://172.31.22.216:5000/yolo
  16 threads and 16 connections
  Thread calibration: mean lat.: 119.183ms, rate sampling interval: 609ms
  Thread calibration: mean lat.: 117.727ms, rate sampling interval: 658ms
  Thread calibration: mean lat.: 107.460ms, rate sampling interval: 594ms
  Thread calibration: mean lat.: 112.177ms, rate sampling interval: 626ms
  Thread calibration: mean lat.: 109.540ms, rate sampling interval: 582ms
  Thread calibration: mean lat.: 112.504ms, rate sampling interval: 616ms
  Thread calibration: mean lat.: 118.047ms, rate sampling interval: 607ms
  Thread calibration: mean lat.: 112.765ms, rate sampling interval: 581ms
  Thread calibration: mean lat.: 110.720ms, rate sampling interval: 605ms
  Thread calibration: mean lat.: 116.392ms, rate sampling interval: 625ms
  Thread calibration: mean lat.: 109.778ms, rate sampling interval: 601ms
  Thread calibration: mean lat.: 114.688ms, rate sampling interval: 622ms
  Thread calibration: mean lat.: 125.530ms, rate sampling interval: 667ms
  Thread calibration: mean lat.: 104.589ms, rate sampling interval: 574ms
  Thread calibration: mean lat.: 117.764ms, rate sampling interval: 627ms
  Thread calibration: mean lat.: 130.071ms, rate sampling interval: 663ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   715.95ms  949.48ms   2.60s    73.75%
    Req/Sec    36.07      7.20    48.00     84.22%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   86.46ms
 75.000%    1.73s 
 90.000%    2.31s 
 99.000%    2.53s 
 99.900%    2.58s 
 99.990%    2.59s 
 99.999%    2.60s 
100.000%    2.60s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.587     0.000000            1         1.00
      16.279     0.100000         2924         1.11
      19.519     0.200000         5866         1.25
      24.271     0.300000         8773         1.43
      47.871     0.400000        11693         1.67
      86.463     0.500000        14622         2.00
     113.215     0.550000        16079         2.22
     160.383     0.600000        17542         2.50
     281.343     0.650000        19003         2.86
    1412.095     0.700000        20464         3.33
    1734.655     0.750000        21925         4.00
    1829.887     0.775000        22658         4.44
    1952.767     0.800000        23388         5.00
    2097.151     0.825000        24120         5.71
    2199.551     0.850000        24850         6.67
    2260.991     0.875000        25580         8.00
    2287.615     0.887500        25949         8.89
    2312.191     0.900000        26309        10.00
    2336.767     0.912500        26680        11.43
    2363.391     0.925000        27044        13.33
    2387.967     0.937500        27416        16.00
    2398.207     0.943750        27595        17.78
    2408.447     0.950000        27794        20.00
    2418.687     0.956250        27978        22.86
    2428.927     0.962500        28153        26.67
    2441.215     0.968750        28341        32.00
    2449.407     0.971875        28423        35.56
    2457.599     0.975000        28509        40.00
    2473.983     0.978125        28601        45.71
    2488.319     0.981250        28686        53.33
    2506.751     0.984375        28787        64.00
    2512.895     0.985938        28828        71.11
    2521.087     0.987500        28877        80.00
    2527.231     0.989062        28923        91.43
    2533.375     0.990625        28961       106.67
    2541.567     0.992188        29023       128.00
    2543.615     0.992969        29030       142.22
    2547.711     0.993750        29065       160.00
    2549.759     0.994531        29084       182.86
    2551.807     0.995313        29099       213.33
    2555.903     0.996094        29124       256.00
    2557.951     0.996484        29135       284.44
    2559.999     0.996875        29146       320.00
    2562.047     0.997266        29158       365.71
    2564.095     0.997656        29167       426.67
    2568.191     0.998047        29178       512.00
    2570.239     0.998242        29187       568.89
    2570.239     0.998437        29187       640.00
    2572.287     0.998633        29193       731.43
    2574.335     0.998828        29199       853.33
    2576.383     0.999023        29207      1024.00
    2576.383     0.999121        29207      1137.78
    2578.431     0.999219        29213      1280.00
    2578.431     0.999316        29213      1462.86
    2580.479     0.999414        29219      1706.67
    2580.479     0.999512        29219      2048.00
    2582.527     0.999561        29220      2275.56
    2586.623     0.999609        29221      2560.00
    2588.671     0.999658        29224      2925.71
    2588.671     0.999707        29224      3413.33
    2590.719     0.999756        29227      4096.00
    2590.719     0.999780        29227      4551.11
    2590.719     0.999805        29227      5120.00
    2592.767     0.999829        29228      5851.43
    2592.767     0.999854        29228      6826.67
    2594.815     0.999878        29230      8192.00
    2594.815     0.999890        29230      9102.22
    2594.815     0.999902        29230     10240.00
    2594.815     0.999915        29230     11702.86
    2594.815     0.999927        29230     13653.33
    2598.911     0.999939        29231     16384.00
    2598.911     0.999945        29231     18204.44
    2598.911     0.999951        29231     20480.00
    2598.911     0.999957        29231     23405.71
    2598.911     0.999963        29231     27306.67
    2600.959     0.999969        29232     32768.00
    2600.959     1.000000        29232          inf
#[Mean    =      715.952, StdDeviation   =      949.476]
#[Max     =     2598.912, Total count    =        29232]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  35221 requests in 1.00m, 6.28MB read
Requests/sec:    586.90
Transfer/sec:    107.18KB