benchmarkingExperiments/data/initial_experiments/16t16c700rpsLambda.out
Running 1m test @ https://h0fx1aj2m8.execute-api.ap-south-1.amazonaws.com/Prod/yolo
  16 threads and 16 connections
  Thread calibration: mean lat.: 23.344ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 25.814ms, rate sampling interval: 101ms
  Thread calibration: mean lat.: 27.081ms, rate sampling interval: 112ms
  Thread calibration: mean lat.: 25.878ms, rate sampling interval: 92ms
  Thread calibration: mean lat.: 23.481ms, rate sampling interval: 74ms
  Thread calibration: mean lat.: 23.601ms, rate sampling interval: 73ms
  Thread calibration: mean lat.: 28.528ms, rate sampling interval: 114ms
  Thread calibration: mean lat.: 23.615ms, rate sampling interval: 69ms
  Thread calibration: mean lat.: 24.413ms, rate sampling interval: 71ms
  Thread calibration: mean lat.: 22.089ms, rate sampling interval: 69ms
  Thread calibration: mean lat.: 25.133ms, rate sampling interval: 94ms
  Thread calibration: mean lat.: 24.892ms, rate sampling interval: 104ms
  Thread calibration: mean lat.: 24.370ms, rate sampling interval: 80ms
  Thread calibration: mean lat.: 22.895ms, rate sampling interval: 74ms
  Thread calibration: mean lat.: 22.633ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 23.741ms, rate sampling interval: 79ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.01ms   27.45ms 341.50ms   90.73%
    Req/Sec    43.56      9.15    75.00     74.55%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.91ms
 75.000%   27.01ms
 90.000%   53.73ms
 99.000%  149.89ms
 99.900%  274.69ms
 99.990%  335.87ms
 99.999%  341.76ms
100.000%  341.76ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      12.655     0.000000            1         1.00
      15.951     0.100000         3516         1.11
      16.639     0.200000         7080         1.25
      17.247     0.300000        10534         1.43
      17.951     0.400000        14043         1.67
      18.911     0.500000        17529         2.00
      19.583     0.550000        19265         2.22
      20.511     0.600000        21001         2.50
      21.807     0.650000        22754         2.86
      23.855     0.700000        24500         3.33
      27.007     0.750000        26241         4.00
      29.247     0.775000        27110         4.44
      32.303     0.800000        27984         5.00
      35.647     0.825000        28860         5.71
      40.319     0.850000        29734         6.67
      46.079     0.875000        30610         8.00
      49.375     0.887500        31047         8.89
      53.727     0.900000        31485        10.00
      58.655     0.912500        31924        11.43
      64.447     0.925000        32358        13.33
      71.679     0.937500        32796        16.00
      76.095     0.943750        33014        17.78
      80.895     0.950000        33232        20.00
      86.847     0.956250        33452        22.86
      93.375     0.962500        33669        26.67
     101.375     0.968750        33887        32.00
     105.983     0.971875        33997        35.56
     110.719     0.975000        34106        40.00
     116.351     0.978125        34216        45.71
     122.495     0.981250        34325        53.33
     130.687     0.984375        34434        64.00
     135.039     0.985938        34490        71.11
     140.415     0.987500        34544        80.00
     146.815     0.989062        34600        91.43
     152.703     0.990625        34653       106.67
     159.487     0.992188        34707       128.00
     165.247     0.992969        34735       142.22
     171.903     0.993750        34763       160.00
     180.735     0.994531        34789       182.86
     193.791     0.995313        34817       213.33
     204.415     0.996094        34844       256.00
     209.407     0.996484        34858       284.44
     214.143     0.996875        34871       320.00
     219.775     0.997266        34885       365.71
     229.247     0.997656        34899       426.67
     237.311     0.998047        34913       512.00
     245.887     0.998242        34919       568.89
     252.287     0.998437        34926       640.00
     259.327     0.998633        34933       731.43
     267.775     0.998828        34940       853.33
     277.503     0.999023        34946      1024.00
     288.511     0.999121        34950      1137.78
     294.911     0.999219        34953      1280.00
     303.359     0.999316        34957      1462.86
     311.551     0.999414        34960      1706.67
     318.207     0.999512        34963      2048.00
     320.511     0.999561        34965      2275.56
     324.095     0.999609        34967      2560.00
     325.375     0.999658        34969      2925.71
     326.911     0.999707        34970      3413.33
     329.215     0.999756        34972      4096.00
     329.983     0.999780        34973      4551.11
     330.239     0.999805        34974      5120.00
     332.799     0.999829        34975      5851.43
     332.799     0.999854        34975      6826.67
     335.615     0.999878        34976      8192.00
     335.871     0.999890        34977      9102.22
     335.871     0.999902        34977     10240.00
     339.199     0.999915        34978     11702.86
     339.199     0.999927        34978     13653.33
     339.199     0.999939        34978     16384.00
     339.711     0.999945        34979     18204.44
     339.711     0.999951        34979     20480.00
     339.711     0.999957        34979     23405.71
     339.711     0.999963        34979     27306.67
     339.711     0.999969        34979     32768.00
     341.759     0.999973        34980     36408.89
     341.759     1.000000        34980          inf
#[Mean    =       29.008, StdDeviation   =       27.449]
#[Max     =      341.504, Total count    =        34980]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  41984 requests in 1.00m, 20.42MB read
Requests/sec:    699.57
Transfer/sec:    348.42KB